package com.example.bodymassindex

class Recomendations {
    val thin = "Некоторые рекомендации для худых людей:\n" +
            "\n" +
            "Увеличить калорийность питания. Стоит выбирать питательные продукты, богатые калориями: орехи и семена, авокадо, молочные продукты, мясо и рыбу, зерновые. 3\n" +
            "Увеличить потребление белка. 34 Белки играют важную роль в построении мышц. 3 Рекомендуется потреблять 1,5–2,2 грамма белка на килограмм массы тела в день. 4\n" +
            "Увеличить количество приёмов пищи. Для набора веса необходимо есть чаще: не менее трёх раз в день, плюс перекусы. 4\n" +
            "Добавить силовую нагрузку. Упражнения с отягощением помогают нарастить мышечную ткань. Нагрузка должна быть регулярной и сбалансированной: заниматься в тренажёрном зале 2–4 раза в неделю. 4\n" +
            "Обеспечить здоровый сон. 35 Качественный сон играет важную роль в процессе восстановления и роста мышц. Стоит спать не менее 7–8 часов каждую ночь. 3\n" +
            "Отслеживать прогресс. Регулярно контролировать вес и объёмы тела, чтобы убедиться, что движение в правильном направлении."
    val normal = "У тебя нормальное телосложение. Поддерживай здоровье"
    val fat = "Некоторые рекомендации для людей с избыточной массой тела и ожирением:\n" +
            "\n" +
            "Сбалансированное питание. Калорийность в течение суток должна распределяться так: на завтрак — 25%, второй завтрак — 10%, обед — 35%, полдник — 10%, ужин — 20%. Основой питания должны быть трудно усваиваемые углеводы, на их долю должно приходиться 55–60% суточной калорийности. Рекомендуется включать в рацион овощи 3–4 раза в день в сыром или приготовленном виде, фрукты — не менее 2–3 раз в день. 1\n" +
            "Ограничение высококалорийных продуктов и алкоголя. Следует уменьшить наполовину потребление продуктов средней калорийности и увеличить — низкокалорийных (все виды зелени и овощей, кроме картофеля и бобовых, фрукты, кроме винограда и бананов). 1\n" +
            "Последний приём пищи должен быть не позднее, чем за 2 часа до сна. 4\n" +
            "Медленный приём пищи. Для этого нужно пользоваться десертными приборами, нарезать пищу на очень маленькие кусочки, медленно и тщательно пережёвывать её. 3\n" +
            "Увеличение физической активности. 23 Рекомендуются нагрузки низкой или умеренной интенсивности в зависимости от общего состояния здоровья, наличия сопутствующих заболеваний, прошлого опыта занятий и тренированности. 2\n" +
            "Проведение разминки в начале и заминки в конце занятия. По продолжительности они могут составлять 5–10 минут и состоять из лёгких потягиваний, простых гимнастических упражнений или физической нагрузки низкой интенсивности (например, ходьбы или небыстрой езды на велосипеде). 2\n" +
            "Также важно пить не менее 2 литров жидкости в день, желательно обычной или минеральной воды без газа."

}

